src/InformationRegisters/КритическиеСобытияСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КритическиеСобытияСистемы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьОповещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВозникновения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсточникКритическогоСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникКритическогоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияДляОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/КритическиеСобытияСервер/Ext/Module.bsl
#Область Регистрация_КритическогоСобытия
Процедура ЗарегистрироватьКритическоеСобытие(ОбъектСобытия,ОписаниеОшибки,СтруктураПараметровВызова = неопределено,Оповестить = ложь)
	   СтруктураПараметров = ПолучитьТиповуюСтркутруВызова();
	   
	   Если  НЕ СтруктураПараметровВызова = Неопределено тогда    
		   Для Каждого ЭлементПараметров из СтруктураПараметровВызова цикл 
			    СтруктураПараметров.Вставить(ЭлементПараметров.ключ,ЭлементПараметров.Значение);
			КонецЦикла;	   
		конецесли; 
		
		КритическоеСобытиеЗапись = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
		КритическоеСобытиеЗапись.Период = ТекущаяДата();
		КритическоеСобытиеЗапись.ИсточникКритическогоСобытия = ОбъектСобытия;
		КритическоеСобытиеЗапись.ОписаниеОшибки = ОписаниеОшибки;
		КритическоеСобытиеЗапись.ПараметрыВызова = новый ХранилищеЗначения(СтруктураПараметров);
		КритическоеСобытиеЗапись.ФлагОтправкиОпопвещения =  НеобходимоОпопвещение(ОбъектСобытия,Оповестить);	
		КритическоеСобытиеЗапись.Записать();
	
	КонецПроцедуры
	
	

Функция ПолучитьТиповуюСтркутруВызова()
	   СтруктураПараметровВызова = новый Структура();
	   СтруктураПараметровВызова.Вставить("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	   СтруктураПараметровВызова.Вставить("ДатаСеанса",ТекущаяДатаСеанса());
		СтруктураПараметровВызова.Вставить("НомерСеанса",НомерСеансаИнформационнойБазы());
		   
	   Возврат  СтруктураПараметровВызова;
   КонецФункции	
   
   
   Функция НеобходимоОпопвещение(ОбъектСобытия,Оповестить = ложь)
	   если Оповестить тогда 
		   Возврат Истина
	   КонецЕсли;
	   
	   Если ТипЗнч(ОбъектСобытия) = Тип("СправочникСсылка.РегламентныеЗадания") тогда 
		     Возврат ОбъектСобытия.ОповещатьООшибках ;
	   Иначе 
		   Возврат Ложь;
		   
		КонецЕсли;   
	   
	КонецФункции   
#КонецОбласти

#Область Работа_Кластера_1с


Функция ТекущаяЗагрузкаКластера(СтрокаСоединения = Неопределено,НомерСеанса = Неопределено)
	Если СтрокаСоединения = Неопределено тогда 
		СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;	
	
	ИмяСервера  = НСтр(СтрокаСоединения,"Srvr");
	ИмяБазы =  НСтр(СтрокаСоединения,"Ref");

	  
	Коннектор = Новый COMОбъект("v83.COMConnector");
	Агент = Коннектор.ConnectAgent(ИмяСервера);
	Кластеры = Агент.GetClusters();
	Для каждого Кластер из Кластеры Цикл
	    Агент.Authenticate(Кластер, , );
	
			Базы = Агент.GetInfoBases(Кластер);
			Для каждого База из Базы Цикл
					
		        Сеансы = Агент.GetInfoBaseSessions(Кластер, База);
				
				Если не  НомерСеанса  = Неопределено тогда 
					
				иначе 
					
		        Для каждого Сеанс из Сеансы Цикл
		            Если нРег(Сеанс.AppID) = "srvrconsole" или нРег(Сеанс.AppID) = "comconsole"  Тогда
		                // если это сеансы конфигуратора или фонового задания, то не отключаем
		                Продолжить;
					КонецЕсли;
									
					Сообщение = ""+Сеанс.infoBase.Name+", "+Сеанс.userName+" , Время вызова:"+Сеанс.durationCurrent+", Время вызова сервера:"+Сеанс.durationCurrentDBMS + ", Память текущая: "+ Сеанс.MemoryCurrent+
					 ", заблокировано объектов (упр):"+ Сеанс.blockedByLS + "";
					
										КонецЦикла;
				
				КонецЕсли;
			КонецЦикла;
	
	КонецЦикла;

	
КонецФункции
#конецОбласти
